app/views/users/_creator.html.erb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."creator_id" = $1  [["creator_id", 2]]
---
  <h4>Your Recipes:</h4>
    <% current_user.created_recipes.each do |recipe| %>