app/controllers/recipes_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26)
SELECT "tags".* FROM "tags" INNER JOIN "recipe_tags" ON "tags"."id" = "recipe_tags"."tag_id" WHERE "recipe_tags"."recipe_id" = $1  [["recipe_id", 4]]
SELECT DISTINCT "recipes".* FROM "recipes"
---
  def index
    # session.delete(:user_id)
    # @recipes = Recipe.all.includes(:tags)
    @q = Recipe.ransack(params[:q])
    @recipes = @q.result(distinct: true).includes(:ingredients, :tags, :creator)

INSERT INTO "recipes" ("name", "instructions", "cooking_time", "cooking_style", "created_at", "updated_at", "creator_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @recipe = current_user.created_recipes.create(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "recipe_tags" ON "tags"."id" = "recipe_tags"."tag_id" WHERE "recipe_tags"."recipe_id" = $1  [["recipe_id", 1]]
---
  def show
    @recipe = Recipe.includes(:ingredients, :tags).find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14)
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (2, 3)
---
  def edit
    @recipe = Recipe.includes(:ingredients, :tags).find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = $1 AND "ingredients"."id" IN (17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28)  [["recipe_id", 3]]
SELECT "tags".* FROM "tags" INNER JOIN "recipe_tags" ON "tags"."id" = "recipe_tags"."tag_id" WHERE "recipe_tags"."recipe_id" = $1  [["recipe_id", 1]]
UPDATE "ingredients" SET "name" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["name", "Mayonnaise "], ["updated_at", "2018-01-07 03:08:58.150851"], ["id", 10]]
UPDATE "recipes" SET "cooking_style" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["cooking_style", "Baked"], ["updated_at", "2018-01-07 02:34:01.073381"], ["id", 2]]
UPDATE "tags" SET "body" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["body", "Keto"], ["updated_at", "2018-01-07 03:45:05.595590"], ["id", 2]]
---
  def update
    @recipe = Recipe.includes(:ingredients, :tags).find(params[:id])
    if @recipe.creator == current_user
      if @recipe.update_attributes(recipe_params)