app/controllers/recipes_controller.rb

  def create
    # @user = User.find_by(id: params[:user_id])
    @recipe = Recipe.includes(:ingredients, :tags).new(recipe_params)
    if @recipe.save
---
INSERT INTO "ingredients" ("name", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sdfsdf"], ["amount", "sdfsf"], ["created_at", "2018-01-07 06:52:20.350722"], ["updated_at", "2018-01-07 06:52:20.350722"]]
INSERT INTO "tags" ("body", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["body", "asf"], ["created_at", "2018-01-07 06:52:20.387263"], ["updated_at", "2018-01-07 06:52:20.387263"]]

  def show
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def edit
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]